; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	image1 - mode
	image0 - mode
	Star4 - direction
	Star2 - direction
	Star1 - direction
	GroundStation0 - direction
	GroundStation5 - direction
	Star3 - direction
	GroundStation6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star2)
	(supports instrument1 image1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star2)
	(supports instrument3 image1)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star1)
	(supports instrument4 image0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
	(supports instrument5 image0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 Star3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation6)
)
(:goal (and
	(pointing satellite1 GroundStation5)
	(have_image Planet7 image0)
	(have_image Planet8 image1)
	(have_image Star9 image0)
	(have_image Planet10 image1)
	(have_image Planet11 image0)
	(have_image Star12 image1)
	(have_image Phenomenon13 image1)
	(have_image Phenomenon14 image0)
))

)

; plan
1. (turn_to satellite0 groundstation6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 9
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite0 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite0 planet11 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet11)
   goals met: 0 of 9
5. (take_image satellite0 planet11 instrument1 image0)
   added: (have_image planet11 image0)
   goals met: 1 of 9
6. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 1 of 9
7. (take_image satellite0 planet10 instrument1 image1)
   added: (have_image planet10 image1)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon14 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon14 instrument1 image0)
   added: (have_image phenomenon14 image0)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon13 instrument1 image1)
   added: (have_image phenomenon13 image1)
   goals met: 4 of 9
12. (turn_to satellite0 planet7 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet7)
   goals met: 4 of 9
13. (take_image satellite0 planet7 instrument1 image0)
   added: (have_image planet7 image0)
   goals met: 5 of 9
14. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 5 of 9
15. (take_image satellite0 planet8 instrument1 image1)
   added: (have_image planet8 image1)
   goals met: 6 of 9
16. (turn_to satellite0 star12 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star12)
   goals met: 6 of 9
17. (take_image satellite0 star12 instrument1 image1)
   added: (have_image star12 image1)
   goals met: 7 of 9
18. (turn_to satellite0 star9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star9)
   goals met: 7 of 9
19. (take_image satellite0 star9 instrument1 image0)
   added: (have_image star9 image0)
   goals met: 8 of 9
20. (turn_to satellite1 groundstation5 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 groundstation5)
   goals met: 9 of 9
